import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class TransportsService {

  private busLines = {
    "lines": [
      {
        "name": "الخط الأول",
        "route": [
          "عبد المنعم رياض",
          "رمسيس",
          "عباسية",
          "جامعة الأزهر",
          "محور المشير",
          "معرض الكتاب"
        ]
      },
      {
        "name": "الخط الثاني",
        "route": [
          "دوران شبرا",
          "ش شبرا",
          "أحمد حلمي",
          "ش رمسيس",
          "عباسية",
          "نادي السكة",
          "جامعة الأزهر",
          "محور المشير",
          "معرض الكتاب"
        ]
      },
      {
        "name": "الخط الثالث",
        "route": [
          "النزهة الجديدة",
          "ميدان الحجاز",
          "السبع عمارات",
          "مكرم عبيد",
          "مصطفى النحاس",
          "المنهل",
          "الوفاء والأمل",
          "معرض الكتاب"
        ]
      },
      {
        "name": "الخط الرابع",
        "route": [
          "الأميرية",
          "ميدان المطرية",
          "الحلمية",
          "كلية البنات عين شمس",
          "ميدان الشهيد هشام بركات",
          "الحي السابع",
          "حي السفارات",
          "معرض الكتاب"
        ]
      },
      {
        "name": "الخط الخامس",
        "route": [
          "ميدان الجيزة",
          "جامعة القاهرة",
          "القصر العيني",
          "السيدة عائشة",
          "الأتوستراد",
          "جامعة الأزهر",
          "معرض الكتاب"
        ]
      },
      {
        "name": "الخط السادس",
        "route": [
          "صقر قريش",
          "كارفور المعادي",
          "نادي وادي دجلة",
          "الطريق الدائري",
          "محور المشير",
          "معرض الكتاب"
        ]
      },
      {
        "name": "الخط السابع",
        "route": [
          "المظلات",
          "سراي القبة",
          "روكسي",
          "السبع عمارات",
          "الحي الثامن",
          "الوفاء والأمل",
          "محور المشير",
          "معرض الكتاب"
        ]
      }
    ]
  };

  constructor() { }
  
  getBusLines()
  {
     return this.busLines.lines;
  }
}
